app/controllers/movies_controller.rb

  def index
    @title_style = ""
    @release_date_style = ""
    @all_ratings = []
    @checked_ratings = []
    Movie.select("DISTINCT rating").each do |movie|
      @all_ratings<<movie.rating
    end
    selected_ratings = params[:ratings]
    if !selected_ratings.nil?
      flash[:ratings] = selected_ratings
      @checked_ratings = selected_ratings.keys
      if !flash[:sort].nil?
        @movies = Movie.find(:all, :conditions => { :rating => selected_ratings.keys } , :order => flash[:sort].to_s + " ASC")
        if flash[:sort] == "title"
          @title_style = "hilite"
        else
          @release_date_style = "hilite"
        end
      else
        @movies = Movie.find(:all, :conditions => { :rating => selected_ratings.keys })
      end
    else
      @checked_ratings = @all_ratings
      @movies = Movie.all
---
SELECT DISTINCT rating FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13') ORDER BY release_date ASC
SELECT "movies".* FROM "movies" ORDER BY movie.release_date ASC